app/controllers/entries_controller.rb

    def index
        @entries = Entry.all
---
SELECT "entries".* FROM "entries"

    def favorites
        @favEntries = Entry.all.order(:fav)
---
SELECT "entries".* FROM "entries"  ORDER BY "entries"."fav" ASC

    def best
        @best = Entry.order(:fav).last
---
SELECT  "entries".* FROM "entries"  ORDER BY "entries"."fav" DESC LIMIT 1